/*************************************************************************
	> File Name: 4.c
	> Author: 
	> Mail: 
	> Created Time: 2018年08月27日 星期一 14时32分27秒
 ************************************************************************/

#include<stdio.h>

int main()
{
   /* int a;
    scanf("%d",&a); //从键盘上获取值%d     %c     %s    %f
    printf("%d\n",a);*/

    int a = 18;
    a = a >> 2;  // 18/2^2 = 4

    printf("%d\n",a);//4
    a = a << 3;  //4*2^3 = 32

    printf("%d\n",a);

    a = a | 6; //0000 0110      0010 0110 
    printf("%d\n",a);
    
    //把某位快速置零用为与&

    return -1;
}
