/*************************************************************************
	> File Name: 5.c
	> Author: 
	> Mail: 
	> Created Time: 2018年08月27日 星期一 14时44分18秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    /*
    int a,b;
    char c;
    scanf("%d,%d",&a,&b);    //相同数据类型之间一定要写分隔符（可以是逗号，也可以是空格）
    scanf("%d %d",&a,&b);    //这里是空格外面输入的时候也要以空格隔开，这里是逗号外面输入的时候也要以逗号分隔开
    scanf("%d%c%d",&a,&c,&b);//不同数据类型可以不分开
    scanf("%1d%1d",&a,&b);
    printf("%d\n%d\n",a,b);
    */

    char x;
    x = getchar(); //从键盘上获取一个字符
    
    putchar(x);    //将 x 变量里面存的字符输出
    putchar('\n');
    return  0;
}
