/*************************************************************************
	> File Name: 7.c
	> Author: 
	> Mail: 
	> Created Time: 2018年08月28日 星期二 14时17分58秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    char a[10] = "abCdEFg";
    char b[10] = "##asd##c";
    int i = 0;
    while(a[i] != '\0'){
        if(a[i] >= 'A'&&a[i] <= 'Z'){
            a[i] = a[i] + 'a' - 'A';   //a[i]+=32;
        }
        i++;
    }
    printf("%s\n",a);
    return 0;
}
