/*************************************************************************
	> File Name: 8.c
	> Author: 
	> Mail: 
	> Created Time: 2018年08月28日 星期二 14时23分11秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    char a[10] = "##zxc#vb",\
        i=0,\
        j = 0,\
        b[10] = {0};
    while(a[i] != '\0'){
        if(a[i] != '#'){
            b[j] = a[i];
            j++;
        }
        i++;
    }
    printf("%s\n",b);

    //aaaabbbbccccc ->  abc
    return 0;
}
