/*************************************************************************
	> File Name: maopao.c
	> Author: 
	> Mail: 
	> Created Time: 2018年08月28日 星期二 15时08分17秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    int a[10] = {9,3,1,4,6,7,5,2,0,8};
    int i,n = 9;
    while(n--){
        for(i = 0;i < 9;i++){
            if(a[i] > a[i+1]){
                a[i]^=a[i+1];
                a[i+1]^=a[i];
                a[i]^=a[i+1];
            }
        }
    }

    for(i = 0;i < 10;i++){
        printf("%3d",a[i]);
    }

    return 0;
}
