/*************************************************************************
	> File Name: max.c
	> Author: 
	> Mail: 
	> Created Time: 2018年08月28日 星期二 15时21分41秒
 ************************************************************************/

#include<stdio.h>

int main()
{
    int a[3][4] = {{1,2,3,4},{45,62,3,1},{1}}; // {1,2,3,4,5,6,7,8,9};  
    int max = 0,m,n;
    int i = 0,j = 0;
    for(j = 0;j < 3;j++){
        for(i = 0;i < 4;i++){
            if(a[j][i] > max){
                max  = a[j][i];
                n = j;
                m = i;
            }
        }
    }
    printf("max = %d , n=%d , m=%d\n",max,n,m);
    return 0;
}
